; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v7)
             (pred_5 ?v5 ?v3)
             (pred_1 ?v6 ?v3)
             (pred_2 ?v11 ?v6 )
	     (pred_8 ?v6)
             (pred_9 ?v12)
             (pred_12 ?v5)
             (pred_3 ?v3)
             (pred_10 ?v6)
             (pred_6 ?v5)
             (pred_7 ?v6)
             (pred_4 ))



(:action op_4
:parameters (?v8 ?v1 ?v4 ?v2)
:precondition (and (pred_9 ?v8) (pred_9 ?v1) (pred_12 ?v4) (pred_3 ?v2)
          (pred_11 ?v8 ?v1) (pred_5 ?v4 ?v2)
                   (pred_1 ?v1 ?v2) (pred_8 ?v8) 
                   (pred_10 ?v1) (pred_6 ?v4))
:effect (and  (pred_7 ?v1) (not (pred_10 ?v1))))


(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_9 ?v8) (pred_9 ?v10)
               (pred_8 ?v8) (pred_11 ?v8 ?v10) (pred_7 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v8))))

(:action op_5
:parameters (?v8 ?v4)
:precondition (and (pred_9 ?v8) (pred_12 ?v4) 
                  (pred_8 ?v8) (pred_2 ?v4 ?v8) (pred_4 ))
:effect (and (pred_6 ?v4)
   (not (pred_2 ?v4 ?v8)) (not (pred_4 ))))


(:action op_2
:parameters (?v8 ?v9 ?v13)
:precondition (and (pred_9 ?v8) (pred_12 ?v9) (pred_12 ?v13)
                  (pred_8 ?v8) (pred_6 ?v13) (pred_2 ?v9 ?v8))
:effect (and (pred_6 ?v9) (pred_2 ?v13 ?v8)
        (not (pred_6 ?v13)) (not (pred_2 ?v9 ?v8))))

(:action op_1
:parameters (?v8 ?v4)
:precondition (and (pred_9 ?v8) (pred_12 ?v4) 
                  (pred_8 ?v8) (pred_6 ?v4))
:effect (and (pred_4 ) (pred_2 ?v4 ?v8) (not (pred_6 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_28 obj_11 obj_18 obj_02 obj_21 obj_25 obj_08 obj_01 obj_14 obj_09 obj_07 obj_23 obj_19 obj_03 obj_05 obj_29 obj_15 obj_10 obj_17 obj_27 obj_20 obj_06 obj_24 obj_13
    obj_26 obj_22
    obj_12 obj_30 obj_16
    )

    (:init
       (pred_4)

       (pred_9 obj_04)
       (pred_9 obj_28)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_02)
       (pred_9 obj_21)
       (pred_9 obj_25)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_03)
       (pred_9 obj_05)
       (pred_9 obj_29)
       (pred_9 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_17)
       (pred_9 obj_27)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_24)
       (pred_9 obj_13)
       (pred_3 obj_26)
       (pred_3 obj_22)
       (pred_12 obj_12)
       (pred_12 obj_30)
       (pred_12 obj_16)

       (pred_11 obj_04 obj_21)
       (pred_11 obj_04 obj_28)
       (pred_11 obj_28 obj_25)
       (pred_11 obj_28 obj_11)
       (pred_11 obj_28 obj_04)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_11 obj_18)
       (pred_11 obj_11 obj_28)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_02 obj_14)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_25 obj_07)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_25 obj_28)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_02)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_07 obj_29)
       (pred_11 obj_07 obj_23)
       (pred_11 obj_07 obj_25)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_23 obj_19)
       (pred_11 obj_23 obj_08)
       (pred_11 obj_23 obj_07)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_19 obj_23)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_05 obj_27)
       (pred_11 obj_05 obj_29)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_29 obj_20)
       (pred_11 obj_29 obj_15)
       (pred_11 obj_29 obj_07)
       (pred_11 obj_29 obj_05)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_15 obj_10)
       (pred_11 obj_15 obj_23)
       (pred_11 obj_15 obj_29)
       (pred_11 obj_10 obj_24)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_15)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_27 obj_05)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_29)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_06 obj_24)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_24 obj_13)
       (pred_11 obj_24 obj_10)
       (pred_11 obj_24 obj_06)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_13 obj_24)
       (pred_10 obj_18)
       (pred_10 obj_21)
       (pred_10 obj_23)
       (pred_1  obj_18 obj_26)
       (pred_1  obj_21 obj_22)
       (pred_1  obj_23 obj_22)
       (pred_7 obj_04)
       (pred_7 obj_28)
       (pred_7 obj_11)
       (pred_7 obj_02)
       (pred_7 obj_25)
       (pred_7 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_7 obj_07)
       (pred_7 obj_19)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_29)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_27)
       (pred_7 obj_20)
       (pred_7 obj_06)
       (pred_7 obj_24)
       (pred_7 obj_13)

       (pred_5  obj_12 obj_26)
       (pred_5  obj_30 obj_22)
       (pred_5  obj_16 obj_26)
       (pred_2 obj_12 obj_23)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_16 obj_17)
       (pred_8 obj_20)
    )

    (:goal (and
       (pred_2 obj_16 obj_29)
    ))
(:constraints
  (always (not (pred_8 obj_10)))
)
)

; plan
1. (op_3 obj_20 obj_06)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_06)
   goals met: 0 of 1
2. (op_3 obj_06 obj_24)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_24)
   goals met: 0 of 1
3. (op_3 obj_24 obj_13)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_13)
   goals met: 0 of 1
4. (op_3 obj_13 obj_17)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_17)
   goals met: 0 of 1
5. (op_5 obj_17 obj_16)
   deleted: (pred_2 obj_16 obj_17) (pred_4)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_3 obj_17 obj_13)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_24)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_24)
   goals met: 0 of 1
8. (op_3 obj_24 obj_06)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_06)
   goals met: 0 of 1
9. (op_3 obj_06 obj_15)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_15)
   goals met: 0 of 1
10. (op_3 obj_15 obj_29)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_29)
   goals met: 0 of 1
11. (op_1 obj_29 obj_16)
   deleted: (pred_6 obj_16)
   added: (pred_4) (pred_2 obj_16 obj_29)
   goals met: 1 of 1
